experiments/moviereview_4node/expected_results/qps3500/wrk_warmup.log
Running 30s test @ http://ip-172-31-4-87.us-east-2.compute.internal:8080
  4 threads and 96 connections
  Thread calibration: mean lat.: 8.151ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 11.030ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.555ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 11.116ms, rate sampling interval: 20ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.80ms    1.56ms  20.21ms   69.62%
    Req/Sec     0.90k   120.23     1.33k    69.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.29ms
 75.000%    7.93ms
 90.000%    9.03ms
 99.000%   11.24ms
 99.900%   13.03ms
 99.990%   17.71ms
 99.999%   19.79ms
100.000%   20.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.155     0.000000            1         1.00
       5.183     0.100000         6988         1.11
       5.463     0.200000        13952         1.25
       5.711     0.300000        20916         1.43
       5.971     0.400000        27929         1.67
       6.287     0.500000        34828         2.00
       6.503     0.550000        38300         2.22
       6.803     0.600000        41760         2.50
       7.183     0.650000        45234         2.86
       7.567     0.700000        48728         3.33
       7.927     0.750000        52193         4.00
       8.099     0.775000        53946         4.44
       8.279     0.800000        55698         5.00
       8.447     0.825000        57434         5.71
       8.631     0.850000        59154         6.67
       8.831     0.875000        60925         8.00
       8.927     0.887500        61763         8.89
       9.031     0.900000        62617        10.00
       9.159     0.912500        63514        11.43
       9.295     0.925000        64392        13.33
       9.447     0.937500        65227        16.00
       9.543     0.943750        65699        17.78
       9.639     0.950000        66106        20.00
       9.751     0.956250        66535        22.86
       9.903     0.962500        66963        26.67
      10.071     0.968750        67400        32.00
      10.183     0.971875        67614        35.56
      10.311     0.975000        67838        40.00
      10.455     0.978125        68054        45.71
      10.623     0.981250        68276        53.33
      10.815     0.984375        68484        64.00
      10.919     0.985938        68597        71.11
      11.031     0.987500        68702        80.00
      11.151     0.989062        68812        91.43
      11.295     0.990625        68916       106.67
      11.463     0.992188        69029       128.00
      11.535     0.992969        69080       142.22
      11.615     0.993750        69135       160.00
      11.711     0.994531        69190       182.86
      11.815     0.995313        69243       213.33
      11.983     0.996094        69299       256.00
      12.055     0.996484        69324       284.44
      12.143     0.996875        69352       320.00
      12.231     0.997266        69379       365.71
      12.319     0.997656        69405       426.67
      12.471     0.998047        69434       512.00
      12.559     0.998242        69446       568.89
      12.623     0.998437        69460       640.00
      12.687     0.998633        69473       731.43
      12.919     0.998828        69487       853.33
      13.063     0.999023        69501      1024.00
      13.135     0.999121        69509      1137.78
      13.239     0.999219        69514      1280.00
      13.495     0.999316        69521      1462.86
      13.655     0.999414        69528      1706.67
      13.775     0.999512        69535      2048.00
      13.911     0.999561        69538      2275.56
      14.455     0.999609        69541      2560.00
      15.319     0.999658        69545      2925.71
      15.743     0.999707        69548      3413.33
      16.359     0.999756        69552      4096.00
      16.375     0.999780        69553      4551.11
      17.039     0.999805        69555      5120.00
      17.119     0.999829        69558      5851.43
      17.119     0.999854        69558      6826.67
      17.631     0.999878        69560      8192.00
      17.711     0.999890        69562      9102.22
      17.711     0.999902        69562     10240.00
      17.887     0.999915        69563     11702.86
      17.887     0.999927        69563     13653.33
      19.503     0.999939        69564     16384.00
      19.535     0.999945        69565     18204.44
      19.535     0.999951        69565     20480.00
      19.775     0.999957        69566     23405.71
      19.775     0.999963        69566     27306.67
      19.775     0.999969        69566     32768.00
      19.791     0.999973        69567     36408.89
      19.791     0.999976        69567     40960.00
      19.791     0.999979        69567     46811.43
      19.791     0.999982        69567     54613.33
      19.791     0.999985        69567     65536.00
      20.223     0.999986        69568     72817.78
      20.223     1.000000        69568          inf
#[Mean    =        6.802, StdDeviation   =        1.563]
#[Max     =       20.208, Total count    =        69568]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%    5.34ms
 75.000%    7.03ms
 90.000%    8.02ms
 99.000%   10.10ms
 99.900%   11.85ms
 99.990%   16.69ms
 99.999%   19.14ms
100.000%   19.22ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.955     0.000000            1         1.00
       4.615     0.100000         7036         1.11
       4.787     0.200000        13969         1.25
       4.935     0.300000        20989         1.43
       5.095     0.400000        27891         1.67
       5.335     0.500000        34818         2.00
       5.571     0.550000        38308         2.22
       5.975     0.600000        41758         2.50
       6.399     0.650000        45239         2.86
       6.731     0.700000        48719         3.33
       7.031     0.750000        52196         4.00
       7.179     0.775000        53923         4.44
       7.327     0.800000        55698         5.00
       7.475     0.825000        57436         5.71
       7.639     0.850000        59166         6.67
       7.815     0.875000        60890         8.00
       7.915     0.887500        61771         8.89
       8.015     0.900000        62613        10.00
       8.135     0.912500        63490        11.43
       8.263     0.925000        64365        13.33
       8.431     0.937500        65259        16.00
       8.527     0.943750        65686        17.78
       8.623     0.950000        66108        20.00
       8.735     0.956250        66532        22.86
       8.863     0.962500        66964        26.67
       9.031     0.968750        67401        32.00
       9.127     0.971875        67619        35.56
       9.247     0.975000        67833        40.00
       9.367     0.978125        68047        45.71
       9.527     0.981250        68273        53.33
       9.711     0.984375        68485        64.00
       9.807     0.985938        68598        71.11
       9.927     0.987500        68703        80.00
      10.031     0.989062        68812        91.43
      10.159     0.990625        68922       106.67
      10.319     0.992188        69028       128.00
      10.383     0.992969        69080       142.22
      10.471     0.993750        69137       160.00
      10.575     0.994531        69188       182.86
      10.687     0.995313        69243       213.33
      10.791     0.996094        69299       256.00
      10.863     0.996484        69324       284.44
      10.951     0.996875        69353       320.00
      11.047     0.997266        69378       365.71
      11.159     0.997656        69406       426.67
      11.287     0.998047        69434       512.00
      11.343     0.998242        69446       568.89
      11.463     0.998437        69461       640.00
      11.519     0.998633        69473       731.43
      11.703     0.998828        69487       853.33
      11.879     0.999023        69501      1024.00
      11.991     0.999121        69507      1137.78
      12.167     0.999219        69514      1280.00
      12.399     0.999316        69521      1462.86
      12.911     0.999414        69528      1706.67
      13.095     0.999512        69535      2048.00
      13.295     0.999561        69538      2275.56
      13.575     0.999609        69541      2560.00
      14.383     0.999658        69545      2925.71
      14.495     0.999707        69548      3413.33
      15.255     0.999756        69552      4096.00
      15.607     0.999780        69553      4551.11
      15.735     0.999805        69555      5120.00
      16.039     0.999829        69557      5851.43
      16.111     0.999854        69558      6826.67
      16.327     0.999878        69560      8192.00
      16.687     0.999890        69561      9102.22
      16.719     0.999902        69562     10240.00
      16.975     0.999915        69563     11702.86
      16.975     0.999927        69563     13653.33
      18.191     0.999939        69564     16384.00
      19.007     0.999945        69565     18204.44
      19.007     0.999951        69565     20480.00
      19.023     0.999957        69566     23405.71
      19.023     0.999963        69566     27306.67
      19.023     0.999969        69566     32768.00
      19.135     0.999973        69567     36408.89
      19.135     0.999976        69567     40960.00
      19.135     0.999979        69567     46811.43
      19.135     0.999982        69567     54613.33
      19.135     0.999985        69567     65536.00
      19.215     0.999986        69568     72817.78
      19.215     1.000000        69568          inf
#[Mean    =        5.980, StdDeviation   =        1.433]
#[Max     =       19.200, Total count    =        69568]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  104806 requests in 30.00s, 18.39MB read
  Non-2xx or 3xx responses: 3
Requests/sec:   3493.42
Transfer/sec:    627.74KB